ka2_2024/src/Catalogs/МашиночитаемыеДоверенностиКонтрагентов/МашиночитаемыеДоверенностиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МашиночитаемыеДоверенностиКонтрагентов</name>
  <attributes>
    <name>XMLфайлМЧД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Верна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузкиИзРеестра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтзыва</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата создания в ИБ</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Доверитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВРеестреФНС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоПредставителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отозвана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолномочияОграничены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредставитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредставительИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСкриптПроверкиПолномочий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СовместныеПолномочия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВРеестреФНС</name>
    <type>
      <types>EnumRef.СтатусыМашиночитаемойДоверенностиВРеестреФНС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибкиПроверкиМЧД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПодпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННДоверителяРодительскойДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРодительскойДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполненияПолномочий</name>
    <type>
      <types>EnumRef.ВариантыЗаполненияПолномочийМЧД</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представители</name>
    <attributes>
      <name>Представитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>240</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставительИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Catalogs/МашиночитаемыеДоверенностиКонтрагентов/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = МашиночитаемыеДоверенности.ПредставлениеОбъекта(ЭтотОбъект);
	МЧД = Справочники.МашиночитаемыеДоверенностиКонтрагентов.НайтиПоРеквизиту("НомерДоверенности", НомерДоверенности);
	
	Если ЗначениеЗаполнено(МЧД) И Ссылка <> МЧД Тогда
		
		ДополнительныеСвойства.Вставить("МЧД", МЧД);
		ТекстСообщения = НСтр("ru = 'Доверенность с таким номером уже существует'") + ": " + НомерДоверенности;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Отозвана И Не ЗначениеЗаполнено(ДатаОтзыва) Тогда
		ДатаОтзыва = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не Отозвана И ЗначениеЗаполнено(ДатаОтзыва) Тогда
		ДатаОтзыва = Дата(1, 1, 1);	
	КонецЕсли;
	
	Если Верна И Не Подписана Тогда
		Верна = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ХешФайла) Тогда
		ДанныеФайла = XMLфайлМЧД.Получить();
		Если ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные") Тогда
			ХешФайла = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ДанныеФайла, ХешФункция.SHA256);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗаписиВЖурналМЧД = МашиночитаемыеДоверенности.НовыеПараметрыЗаписиВЖурналМЧД();
	ДополнительныеСвойства.Вставить("ПараметрыЗаписиВЖурналМЧД", ПараметрыЗаписиВЖурналМЧД);
	Если Не ЭтоНовый() Тогда
		ПредыдущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ХешФайла");
		Если ПредыдущиеЗначенияРеквизитов.ХешФайла <> ХешФайла Тогда
			ПараметрыЗаписиВЖурналМЧД.ИзменилсяХеш = Истина;
			ПараметрыЗаписиВЖурналМЧД.ПредыдущееЗначениеХеша = ПредыдущиеЗначенияРеквизитов.ХешФайла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область События

// Добавляет или обновляет запись в журнале МЧД. Возникает в подписке ПриЗаписи.
// См. МашиночитаемыеДоверенности.ЗаписатьМашиночитаемуюДоверенностьВЖурнал
// 
// Параметры:
//  Отказ - Булево
Процедура ЗаписатьВЖурнал(Отказ) Экспорт
	ДанныеДоверенности = XMLфайлМЧД.Получить(); // ДвоичныеДанные
	
	Если Не ЗначениеЗаполнено(ХешФайла) Или Не Подписана Или ДанныеДоверенности = Неопределено
		Или СуществуетДоверенностьОрганизации() Тогда
		Возврат;
	КонецЕсли;
	
	Журнал = РегистрыСведений.ЖурналМашиночитаемыхДоверенностей;
	Запись = Журнал.НоваяЗаписьЖурнала();
	Запись.Хеш = ХешФайла;
	Запись.Номер = НомерДоверенности;
	СведенияФайла = МашиночитаемыеДоверенности.ДанныеИзФайлаОбмена(ДанныеДоверенности).ДанныеДоверенности;
	ТипыДоверителей = Журнал.ТипыДоверителей();
	Если ЗначениеЗаполнено(СведенияФайла.ДоверительФЛ_СНИЛС) Тогда
		СведенияДоверителя = Журнал.НовыйДоверитель(ТипыДоверителей.ИндивидуальныйПредприниматель);
		СведенияДоверителя.ДанныеИндивидуальногоПредпринимателя.Наименование = ОбщегоНазначенияБЭДКлиентСервер.ФИОСтрокой(
			СведенияФайла.ФИО[0]);
		СведенияДоверителя.ДанныеИндивидуальногоПредпринимателя.ИНН = СведенияФайла.ДоверительФЛ_ИНН;
		СведенияДоверителя.ДанныеИндивидуальногоПредпринимателя.СНИЛС = СведенияФайла.ДоверительФЛ_СНИЛС;
	Иначе
		СведенияДоверителя = Журнал.НовыйДоверитель(ТипыДоверителей.ЮридическоеЛицо);
		СведенияДоверителя.ДанныеЮридическогоЛица.Наименование = СведенияФайла.ДоверительЮЛ_НаимОрг;
		СведенияДоверителя.ДанныеЮридическогоЛица.ИНН = СведенияФайла.ДоверительЮЛ_ИНН;
		СведенияДоверителя.ДанныеЮридическогоЛица.КПП = СведенияФайла.ДоверительЮЛ_КПП;
		СведенияДоверителя.ДанныеЮридическогоЛица.ОГРН = СведенияФайла.ДоверительЮЛ_ОГРН;
		ЛицоБезДоверенности = Журнал.НовоеФизическоеЛицо();
		ЛицоБезДоверенности.ФИО = Строка(СведенияФайла.ЛицоБезДовФЛ);
		ЛицоБезДоверенности.СНИЛС = СведенияФайла.ЛицоБезДовФЛ_СНИЛС;
		ЛицоБезДоверенности.ИНН = СведенияФайла.ЛицоБезДовФЛ_ИНН;
		СведенияДоверителя.ДанныеЮридическогоЛица.ЛицаБезДоверенности.Добавить(ЛицоБезДоверенности);
	КонецЕсли;
	Запись.Доверители.Добавить(СведенияДоверителя);
	ТипыПредставителей = Журнал.ТипыПредставителей();
	Для Каждого ПредставительОбъекта Из СведенияФайла.Представители Цикл
		ФИО = ОбщегоНазначенияБЭДКлиентСервер.ФИОСтрокой(ПредставительОбъекта);
		Если ПредставительОбъекта.ТипУполномоченногоПредставителя = "ФЛ" Тогда
			Представитель = Журнал.НовыйПредставитель(ТипыПредставителей.ФизическоеЛицо);
			Представитель.ДанныеФизическогоЛица.ФИО = ФИО;
			Представитель.ДанныеФизическогоЛица.ИНН = ПредставительОбъекта.ПредставительФЛ_ИНН;
			Представитель.ДанныеФизическогоЛица.СНИЛС = ПредставительОбъекта.ПредставительФЛ_СНИЛС;
		ИначеЕсли ПредставительОбъекта.ТипУполномоченногоПредставителя = "ЮЛ" Тогда
			Представитель = Журнал.НовыйПредставитель(ТипыПредставителей.ЮридическоеЛицо);
			Представитель.ДанныеЮридическогоЛица.Наименование = ПредставительОбъекта.ПредставительЮЛ_НаимОрг;
			Представитель.ДанныеЮридическогоЛица.ИНН = ПредставительОбъекта.ПредставительЮЛ_ИНН;
			Представитель.ДанныеЮридическогоЛица.КПП = ПредставительОбъекта.ПредставительЮЛ_КПП;
			Представитель.ДанныеЮридическогоЛица.ОГРН = ПредставительОбъекта.ПредставительЮЛ_ОГРН;
			ЛицоБезДоверенности = Журнал.НовоеФизическоеЛицо();
			ЛицоБезДоверенности.ФИО = ФИО;
			ЛицоБезДоверенности.СНИЛС = ПредставительОбъекта.ПредставительФЛ_СНИЛС;
			ЛицоБезДоверенности.ИНН = ПредставительОбъекта.ПредставительФЛ_ИНН;
			Представитель.ДанныеЮридическогоЛица.ЛицаБезДоверенности.Добавить(ЛицоБезДоверенности);
		ИначеЕсли ПредставительОбъекта.ТипУполномоченногоПредставителя = "ИП" Тогда
			Представитель = Журнал.НовыйПредставитель(ТипыПредставителей.ИндивидуальныйПредприниматель);
			Представитель.ДанныеИндивидуальногоПредпринимателя.Наименование = ПредставительОбъекта.ПредставительЮЛ_НаимОрг;
			Представитель.ДанныеИндивидуальногоПредпринимателя.ИНН = ПредставительОбъекта.ПредставительЮЛ_ИНН;
			Представитель.ДанныеИндивидуальногоПредпринимателя.СНИЛС = ПредставительОбъекта.ПредставительФЛ_СНИЛС;
			Представитель.ДанныеИндивидуальногоПредпринимателя.ОГРН = ПредставительОбъекта.ПредставительЮЛ_ОГРН;
		Иначе
			Продолжить;
		КонецЕсли;
		Запись.Представители.Добавить(Представитель);
	КонецЦикла;
	Запись.ДатаВыдачи = ДатаВыдачи;
	Запись.Доверенность = Ссылка;
	Запись.ДатаОкончанияДействия = ДатаОкончанияДействия();
	Запись.Верна = Верна;
	Запись.Действует = Действует();
	Запись.ПометкаУдаления = ПометкаУдаления;
	Журнал.ДобавитьЗапись(Запись);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция Действует()
	СвойстваДоверенности = МашиночитаемыеДоверенности.НовыеСвойстваДоверенности();
	ЗаполнитьЗначенияСвойств(СвойстваДоверенности, ЭтотОбъект);
	Возврат МашиночитаемыеДоверенности.ДоверенностьДействительнаПоСвойствам(СвойстваДоверенности, ТекущаяДатаСеанса());
КонецФункции

Функция ДатаОкончанияДействия()
	Если ЗначениеЗаполнено(ДатаОкончания) И Не ЗначениеЗаполнено(ДатаОтзыва) Тогда
		Возврат ДатаОкончания;
	ИначеЕсли ЗначениеЗаполнено(ДатаОтзыва) И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат ДатаОтзыва;
	Иначе
		Возврат Мин(ДатаОкончания, ДатаОтзыва);
	КонецЕсли;
КонецФункции

Функция СуществуетДоверенностьОрганизации()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	Ссылка
				   |ИЗ
				   |	Справочник.МашиночитаемыеДоверенностиОрганизаций
				   |ГДЕ
				   |	ХешФайла = &ХешФайла";
	Запрос.УстановитьПараметр("ХешФайла", ХешФайла);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
